# <font color="purple"><h3 align="center">Pandas Merge Tutorial</h3></font>

<img src="merge_pandas.JPG" width="600" height="500">

In [1]:
import pandas as pd

"""
parameter of merge():

    how = 'inner', 
    on = None, 
    left_on = None,
    right_on = None, 
    left_index = False, 
    right_index  = False, 
    sort = False,  
    suffixes = ('_x', '_y'), 
    copy = None,  
    indicator = False, 
    validate = None)
    
"""
print('All parameter are shown above.')

All parameter are shown above.

## <font color='blue'>Basic Merge Using a Dataframe Column</font>

In [2]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [3]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [4]:
df3 = pd.merge(df1, df2, on="city")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## <font color='blue'>Parameter: 'left_on',  'right_on'</font>

In [43]:
d1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz'],
                   'value': [1, 2, 3]})
d2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz'],
                     'value': [5, 6, 7]})
d1

  lkey  value
0  foo      1
1  bar      2
2  baz      3

In [44]:
d2

  rkey  value
0  foo      5
1  bar      6
2  baz      7

In [45]:
d1.merge(d2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  bar        2  bar        6
2  baz        3  baz        7

In [46]:
d1.merge(d2, left_on='lkey', right_on='rkey',
          suffixes=('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  bar           2  bar            6
2  baz           3  baz            7

In [47]:
df1 = pd.DataFrame({'key1': ['A', 'B', 'C'], 'value1': [1, 2, 3]})
df2 = pd.DataFrame({'key2': ['A', 'B', 'D'], 'value2': [4, 5, 6]})

pd.merge(df1, df2, left_on='key1', right_on='key2',how='left')

  key1  value1 key2  value2
0    A       1    A     4.0
1    B       2    B     5.0
2    C       3  NaN     NaN

## <font color='blue'>Type Of DataBase Joins (parameter: 'how')</font>

<img src="db_joins.jpg" width="600" height="500">

In [5]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [6]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "humidity": [65,68,71],
})
df2

        city  humidity
0    chicago        65
1   new york        68
2  san diego        71

In [7]:
df3=pd.merge(df1,df2,on="city",how="inner")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [8]:
df3=pd.merge(df1,df2,on="city",how="outer")
df3

        city  temperature  humidity
0   new york         21.0      68.0
1    chicago         14.0      65.0
2    orlando         35.0       NaN
3  baltimore         38.0       NaN
4  san diego          NaN      71.0

In [9]:
df3=pd.merge(df1,df2,on="city",how="left")
df3

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           38       NaN

In [10]:
df3=pd.merge(df1,df2,on="city",how="right")
df3

        city  temperature  humidity
0    chicago         14.0        65
1   new york         21.0        68
2  san diego          NaN        71

## <font color='blue'>suffixes</font>

In [12]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [13]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df2

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [14]:
df3= pd.merge(df1,df2,on="city",how="outer", suffixes=('_first','_second'))
df3

,city,temperature_first,humidity_first,temperature_second,humidity_second
0,new york,21.0,65.0,14.0,68.0
1,chicago,14.0,68.0,21.0,65.0
2,orlando,35.0,71.0,NaN,NaN
3,baltimore,38.0,75.0,NaN,NaN
4,san diego,NaN,NaN,35.0,71.0

## <font color='blue'>indicator flag</font>

In [11]:
df3=pd.merge(df1,df2,on="city",how="outer",indicator=True)
df3

        city  temperature  humidity      _merge
0   new york         21.0      68.0        both
1    chicago         14.0      65.0        both
2    orlando         35.0       NaN   left_only
3  baltimore         38.0       NaN   left_only
4  san diego          NaN      71.0  right_only

## <font color='blue'>join function</font>

In [15]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [60,62,80],
})
df1.set_index('city',inplace=True)
df1

          temperature  humidity
city
new york           21        60
chicago            14        62
orlando            35        80

In [16]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2.set_index('city',inplace=True)
df2

          humidity
city
chicago         65
new york        68
orlando         75

In [17]:
df1.join(df2,lsuffix='_l', rsuffix='_r')

          temperature  humidity_l  humidity_r
city
new york           21          60          68
chicago            14          62          65
orlando            35          80          75